eval/skill-coverage-wave-2026-07-30/I-perf/k6-A-load-pass.txt


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    inbox_read_latency
    ✓ 'p(95)<200' p(95)=1.28ms


  █ TOTAL RESULTS 

    checks_total.......: 1981    98.974045/s
    checks_succeeded...: 100.00% 1981 out of 1981
    checks_failed......: 0.00%   0 out of 1981

    ✓ login succeeded
    ✓ status is 200

    CUSTOM
    inbox_read_latency.............: avg=549.48µs min=0s    med=534µs    max=3.06ms   p(90)=1.16ms   p(95)=1.28ms  

    HTTP
    http_req_duration..............: avg=549.46µs min=0s    med=533.9µs  max=3.06ms   p(90)=1.16ms   p(95)=1.28ms  
      { expected_response:true }...: avg=549.46µs min=0s    med=533.9µs  max=3.06ms   p(90)=1.16ms   p(95)=1.28ms  
    http_req_failed................: 0.00%  0 out of 1981
    http_reqs......................: 1981   98.974045/s

    EXECUTION
    iteration_duration.............: avg=101.03ms min=100ms med=100.99ms max=109.58ms p(90)=101.75ms p(95)=101.95ms
    iterations.....................: 1980   98.924083/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 371 kB 19 kB/s
    data_sent......................: 242 kB 12 kB/s



K6_EXIT=0