eval/skill-coverage-wave-2026-07-30/I-perf/k6-B-load-threshold-break.txt


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    inbox_read_latency
    ✗ 'p(95)<1' p(95)=1.55ms


  █ TOTAL RESULTS 

    checks_total.......: 991     98.877782/s
    checks_succeeded...: 100.00% 991 out of 991
    checks_failed......: 0.00%   0 out of 991

    ✓ login succeeded
    ✓ status is 200

    CUSTOM
    inbox_read_latency.............: avg=659.56µs min=0s    med=570.1µs max=2.79ms   p(90)=1.23ms   p(95)=1.55ms  

    HTTP
    http_req_duration..............: avg=659.41µs min=0s    med=570.1µs max=2.79ms   p(90)=1.23ms   p(95)=1.55ms  
      { expected_response:true }...: avg=659.41µs min=0s    med=570.1µs max=2.79ms   p(90)=1.23ms   p(95)=1.55ms  
    http_req_failed................: 0.00%  0 out of 991
    http_reqs......................: 991    98.877782/s

    EXECUTION
    iteration_duration.............: avg=101.13ms min=100ms med=101.1ms max=103.62ms p(90)=101.93ms p(95)=102.22ms
    iterations.....................: 990    98.778006/s
    vus............................: 10     min=10       max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 185 kB 19 kB/s
    data_sent......................: 121 kB 12 kB/s



time="2026-07-30T23:48:08+02:00" level=error msg="thresholds on metrics 'inbox_read_latency' have been crossed"
K6_EXIT=99