eval/skill-coverage-wave-2026-07-30/I-perf/k6-C-concurrency-integrity.txt
time="2026-07-30T23:48:15+02:00" level=info msg="racer -> 200 {\"report\":{\"id\":\"r2\",\"submitterId\":\"u1\",\"status\":\"rejected\",\"currency\":\"EUR\",\"lines\":[{\"category\":\"meals\",\"amount\":100,\"date\":\"2026-07-30\",\"receipt\":\"r.pdf\"}],\"approvals\":[],\"history\":[{\"event\":\"created\",\"who\":\"employee@demo\",\"at\":1785448095044},{\"event\":\"submitted\",\"who\":\"employee@demo\",\"at\":1785448095044,\"totalEur\":100,\"rateStale\":false},{\"event\":\"rejected\",\"who\":\"manager@demo\",\"at\":1785448095045,\"comment\":\"rejected by concurrency race probe\"}],\"totalEur\":100,\"rateStale\":false}}" source=console
time="2026-07-30T23:48:15+02:00" level=info msg="racer -> 409 {\"error\":\"only a submitted report can be decided\"}" source=console
time="2026-07-30T23:48:15+02:00" level=info msg="racer -> 409 {\"error\":\"only a submitted report can be decided\"}" source=console
time="2026-07-30T23:48:15+02:00" level=info msg="racer -> 409 {\"error\":\"only a submitted report can be decided\"}" source=console
[...]
time="2026-07-30T23:48:15+02:00" level=info msg="final report state: 404 {\"error\":\"report not found\"}" source=console


  █ THRESHOLDS 

    decide_accepted
    ✓ 'count==1' count=1


  █ TOTAL RESULTS 

    checks_total.......: 25      1098.905929/s
    checks_succeeded...: 100.00% 25 out of 25
    checks_failed......: 0.00%   0 out of 25

    ✓ employee login 200
    ✓ draft created 201
    ✓ draft edited 200
    ✓ submitted 200
    ✓ manager login 200
    ✓ decide answered 200 or 409

    CUSTOM
    decide_accepted................: 1      43.956237/s
    decide_conflict................: 19     835.168506/s

    HTTP
    http_req_duration..............: avg=306.48µs min=0s      med=0s      max=1.24ms   p(90)=744.4µs  p(95)=744.4µs
      { expected_response:true }...: avg=147.12µs min=0s      med=0s      max=526.59µs p(90)=512.62µs p(95)=519.6µs
    http_req_failed................: 74.07% 20 out of 27
    http_reqs......................: 27     1186.818404/s

    EXECUTION
    iteration_duration.............: avg=12.47ms  min=11.94ms med=12.35ms max=12.86ms  p(90)=12.86ms  p(95)=12.86ms
    iterations.....................: 20     879.124743/s

    NETWORK
    data_received..................: 7.2 kB 317 kB/s
    data_sent......................: 6.0 kB 263 kB/s



K6_EXIT=0