eval/skill-coverage-wave-2026-07-30/I-perf/k6-D-portability-other-target.txt


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.01' rate=100.00%

    inbox_read_latency
    ✓ 'p(95)<200' p(95)=1.41ms


  █ TOTAL RESULTS 

    checks_total.......: 251     49.480705/s
    checks_succeeded...: 0.00%   0 out of 251
    checks_failed......: 100.00% 251 out of 251

    ✗ login succeeded
      ↳  0% — ✓ 0 / ✗ 1
    ✗ status is 200
      ↳  0% — ✓ 0 / ✗ 250

    CUSTOM
    inbox_read_latency...: avg=680.4µs  min=0s       med=637.1µs  max=2.57ms   p(90)=1.28ms p(95)=1.41ms  

    HTTP
    http_req_duration....: avg=680.97µs min=0s       med=637.1µs  max=2.57ms   p(90)=1.28ms p(95)=1.41ms  
    http_req_failed......: 100.00% 251 out of 251
    http_reqs............: 251     49.480705/s

    EXECUTION
    iteration_duration...: avg=101.24ms min=100.02ms med=101.19ms max=103.58ms p(90)=102ms  p(95)=102.34ms
    iterations...........: 250     49.283571/s
    vus..................: 5       min=5          max=5
    vus_max..............: 5       min=5          max=5

    NETWORK
    data_received........: 51 kB   10 kB/s
    data_sent............: 30 kB   6.0 kB/s



time="2026-07-30T23:48:20+02:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"
K6_EXIT=99