eval/skill-coverage-wave-2026-07-30/I-perf/k6-load-threshold-break.txt


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    inbox_read_latency
    ✗ 'p(95)<1' p(95)=1.97ms


  █ TOTAL RESULTS 

    checks_total.......: 991     98.472928/s
    checks_succeeded...: 100.00% 991 out of 991
    checks_failed......: 0.00%   0 out of 991

    ✓ login succeeded
    ✓ status is 200

    CUSTOM
    inbox_read_latency.............: avg=922.53µs min=0s       med=941.9µs  max=3.89ms   p(90)=1.7ms   p(95)=1.97ms  

    HTTP
    http_req_duration..............: avg=922.11µs min=0s       med=937.9µs  max=3.89ms   p(90)=1.7ms   p(95)=1.97ms  
      { expected_response:true }...: avg=922.11µs min=0s       med=937.9µs  max=3.89ms   p(90)=1.7ms   p(95)=1.97ms  
    http_req_failed................: 0.00%  0 out of 991
    http_reqs......................: 991    98.472928/s

    EXECUTION
    iteration_duration.............: avg=101.54ms min=100.02ms med=101.53ms max=106.01ms p(90)=102.6ms p(95)=103.08ms
    iterations.....................: 990    98.373561/s
    vus............................: 10     min=10       max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 185 kB 18 kB/s
    data_sent......................: 121 kB 12 kB/s



time="2026-07-31T00:57:05+02:00" level=error msg="thresholds on metrics 'inbox_read_latency' have been crossed"
EXIT=99