eval/skill-coverage-wave-2026-07-30/I-perf/k6-portability-stub4601.txt


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.01' rate=100.00%

    inbox_read_latency
    ✓ 'p(95)<200' p(95)=1.77ms


  █ TOTAL RESULTS 

    checks_total.......: 251     49.410077/s
    checks_succeeded...: 0.00%   0 out of 251
    checks_failed......: 100.00% 251 out of 251

    ✗ login succeeded
      ↳  0% — ✓ 0 / ✗ 1
    ✗ status is 200
      ↳  0% — ✓ 0 / ✗ 250

    CUSTOM
    inbox_read_latency...: avg=739.2µs  min=0s       med=633.45µs max=3.99ms   p(90)=1.34ms  p(95)=1.77ms  

    HTTP
    http_req_duration....: avg=749.91µs min=0s       med=633.9µs  max=3.99ms   p(90)=1.38ms  p(95)=1.78ms  
    http_req_failed......: 100.00% 251 out of 251
    http_reqs............: 251     49.410077/s

    EXECUTION
    iteration_duration...: avg=101.34ms min=100.04ms med=101.31ms max=104.36ms p(90)=102.2ms p(95)=102.55ms
    iterations...........: 250     49.213224/s
    vus..................: 5       min=5          max=5
    vus_max..............: 5       min=5          max=5

    NETWORK
    data_received........: 59 kB   12 kB/s
    data_sent............: 30 kB   6.0 kB/s



time="2026-07-31T01:02:36+02:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"