eval/skill-coverage-wave-2026-07-30/I-perf/k6-scalability.txt
time="2026-07-31T01:00:29+02:00" level=warning msg="Request Failed" error="Get \"http://localhost:4500/api/reports?scope=inbox\": dial tcp 127.0.0.1:4500: connectex: No connection could be made because the target machine actively refused it."
time="2026-07-31T01:00:29+02:00" level=warning msg="Request Failed" error="Get \"http://localhost:4500/api/reports?scope=inbox\": dial tcp 127.0.0.1:4500: connectex: No connection could be made because the target machine actively refused it."
time="2026-07-31T01:00:29+02:00" level=warning msg="Request Failed" error="Get \"http://localhost:4500/api/reports?scope=inbox\": dial tcp 127.0.0.1:4500: connectex: No connection could be made because the target machine actively refused it."
[...]


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=0.14%

    inbox_read_latency_vus_10
    ✓ 'p(95)<200' p(95)=1.81ms

    inbox_read_latency_vus_100
    ✓ 'p(95)<200' p(95)=2.72ms

    inbox_read_latency_vus_200
    ✓ 'p(95)<200' p(95)=3.02ms

    inbox_read_latency_vus_400
    ✓ 'p(95)<200' p(95)=3.72ms

    inbox_read_latency_vus_50
    ✓ 'p(95)<200' p(95)=2.43ms


  █ TOTAL RESULTS 

    checks_total.......: 112491 1354.405428/s
    checks_succeeded...: 99.85% 112328 out of 112491
    checks_failed......: 0.14%  163 out of 112491

    ✓ login succeeded
    ✗ status is 200
      ↳  99% — ✓ 112327 / ✗ 163

    CUSTOM
    inbox_read_latency_vus_10......: avg=654.77µs min=0s    med=538.54µs max=3.59ms   p(90)=1.4ms    p(95)=1.81ms  
    inbox_read_latency_vus_100.....: avg=884.7µs  min=0s    med=602.9µs  max=16.08ms  p(90)=2.25ms   p(95)=2.72ms  
    inbox_read_latency_vus_200.....: avg=854.16µs min=0s    med=517.5µs  max=14.62ms  p(90)=2.13ms   p(95)=3.02ms  
    inbox_read_latency_vus_400.....: avg=887.27µs min=0s    med=505.4µs  max=19.14ms  p(90)=2.26ms   p(95)=3.72ms  
    inbox_read_latency_vus_50......: avg=882.15µs min=0s    med=648.4µs  max=7.49ms   p(90)=1.93ms   p(95)=2.43ms  

    HTTP
    http_req_duration..............: avg=874.8µs  min=0s    med=511.9µs  max=19.14ms  p(90)=2.19ms   p(95)=3.13ms  
      { expected_response:true }...: avg=876.07µs min=0s    med=511.9µs  max=19.14ms  p(90)=2.19ms   p(95)=3.14ms  
    http_req_failed................: 0.14%  163 out of 112491
    http_reqs......................: 112491 1354.405428/s

    EXECUTION
    iteration_duration.............: avg=101.48ms min=100ms med=100.95ms max=150.72ms p(90)=102.98ms p(95)=104.07ms
    iterations.....................: 112490 1354.393388/s
    vus............................: 400    min=0             max=400
    vus_max........................: 700    min=700           max=700

    NETWORK
    data_received..................: 21 MB  253 kB/s
    data_sent......................: 14 MB  166 kB/s